1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПеремещениеПаллета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПланированиеУпаковки</xr:Item>
				<xr:Item>InformationRegister.Лико_АдресноеХранение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРастарки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ПричиныРастарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбылСоСклада</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаРастарку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЦепочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИсходнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_АдресноеХранение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_АдресноеХранение</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыбылСоСклада</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЭтапыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЭтапыЗаказа</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПричиныБлокировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОСтатусеПоказанаНаТачпаде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиЭтапа</Name>
					<Comment>Заполняется при перемещении заказа через обработку "Этапы заказов"</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПланированиеУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПланированиеУпаковки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПеремотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Намотка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧестныйЗнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыСкладовГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыСкладовГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараКлиентаУНас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеНашегоТовараУКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтбору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВидыОперацийОтбораРазмещенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОтбораРазмещенияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Размещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыОтборовРазмещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОтборовРазмещенийТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСОшибками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета/Ext/ObjectModule.bsl
Перем КлючиСтруктуры;
Перем ОтключитьЧастьПроверок; 

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Лико_АдресноеХранение
	Если НЕ (ЗначениеЗаполнено(СкладПолучатель) ИЛИ ЗначениеЗаполнено(ЯчейкаПолучатель)) Тогда
		Отказ = Истина;
		Сообщить("Один из реквизитов обязательно должен быть заполнен: ячейка-получатель или склад-получатель");
		Возврат;			
	КонецЕсли;
	
	Лико_Дополнительно.УдалитьЗаписиИзРегистраЛико_ЭтапыЗаказовПоДокументу(Ссылка);
	
	Движения.Лико_АдресноеХранение.Записывать = Истина;
	Если ЗначениеЗаполнено(ЯчейкаПолучатель) Тогда
		Для Каждого ТекСтрокаСодержимое Из Содержимое Цикл
			Движение = Движения.Лико_АдресноеХранение.Добавить();
			Движение.Период = Дата;
			Движение.Серия = ТекСтрокаСодержимое.Серия;
			Движение.Склад = СкладПолучатель;
			Движение.Ячейка = ЯчейкаПолучатель;
			Движение.Паллет = Паллет;
			Движение.ВыбылСоСклада = ТекСтрокаСодержимое.ВыбылСоСклада;
		КонецЦикла;
		
		ОтправительУпаковка = ЯчейкаОтправитель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитСкладаЯчейкаУпаковка", СкладОтправитель);
		ПолучательРастарка = ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладПолучатель, "ЯчейкаРастарка");
		Если ПолучательРастарка И СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас Тогда
			Если Дата < Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра Тогда
				// Нужно проверить, чтобы все коробки были по одной партии
				ТаблицаРастарки = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(Содержимое.ВыгрузитьКолонку("Серия"), СкладПолучатель);
				МассивПриходныхОрдеров = ТаблицаРастарки.ВыгрузитьКолонку("ПриходныйОрдерНаТовары");
				МассивПриходныхОрдеров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПриходныхОрдеров);
				Если МассивПриходныхОрдеров.Количество() > 1 Тогда
					Сообщить("В распоряжении на растарку содержатся коробки из разных партий");
					ТаблицаРастарки.Сортировать("ПриходныйОрдерНаТовары,Серия");
					Для каждого Строка из ТаблицаРастарки Цикл
						Сообщить("" + Строка.Серия + " - " + ?(ЗначениеЗаполнено(Строка.ПриходныйОрдерНаТовары), Строка.ПриходныйОрдерНаТовары, "Партия не найдена"));
					КонецЦикла;
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				Если МассивПриходныхОрдеров.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(МассивПриходныхОрдеров[0]) Тогда
					Сообщить("Не удалось получить партию коробок");
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			Иначе
				// Для новой схемы растарки достаточно того, чтобы по одной и той же характеристике не было разных приходных ордеров
				ТаблицаРастарки = Документы.Лико_ФормированиеПаллета.СформироватьТаблицуДляКорректировкиРегистров(Содержимое.ВыгрузитьКолонку("Серия"), СкладПолучатель);
				
				Для каждого Строка из ТаблицаРастарки Цикл
					Если НЕ ЗначениеЗаполнено(Строка.ПриходныйОрдерНаТовары) Тогда
						Отказ = Истина;
						Сообщить("Для серии " + Строка.Серия + " не удалось найти партию прихода на склад хранения. Обратитесь к программистам");
					КонецЕсли;
				КонецЦикла;
				
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
					|	ВЫРАЗИТЬ(Таблица.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
					|	ВЫРАЗИТЬ(Таблица.ПриходныйОрдерНаТовары КАК Документ.ПриходныйОрдерНаТовары) КАК ПриходныйОрдерНаТовары
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	&Таблица КАК Таблица
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ.Номенклатура КАК Номенклатура,
					|	ВТ.Характеристика КАК Характеристика,
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.ПриходныйОрдерНаТовары) КАК КоличествоПриходныхОрдеров
					|ИЗ
					|	ВТ КАК ВТ
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ.Номенклатура,
					|	ВТ.Характеристика";
				Запрос.УстановитьПараметр("Таблица", ТаблицаРастарки);
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.КоличествоПриходныхОрдеров > 1 Тогда
						Отказ = Истина;
						Сообщить("По позиции " + ВыборкаДетальныеЗаписи.Номенклатура + " (" + ВыборкаДетальныеЗаписи.Характеристика + ") найдено несколько партий, необходимо разделить их на разные документы:");
						НайденныеСерии = ТаблицаРастарки.НайтиСтроки(Новый Структура("Характеристика", ВыборкаДетальныеЗаписи.Характеристика));
						Для каждого Строка из НайденныеСерии Цикл
							Сообщить("" + Строка.Серия + " - " + ?(ЗначениеЗаполнено(Строка.ПриходныйОрдерНаТовары), Строка.ПриходныйОрдерНаТовары, "Партия не найдена"));
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если (ОтправительУпаковка ИЛИ ПолучательРастарка) И НЕ ДополнительныеСвойства.Свойство("НеПерезаполнятьРегистрСведенийЛико_ЭтапыЗаказа") Тогда
			ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= Дата;
			// Добавим записи в Лико_ЭтапыЗаказа
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.Дата КАК Период,
				|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
				|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка КАК Площадка,
				|	СУММА(Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке) КАК Количество,
				|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.АвторДокумента КАК Ответственный
				|ИЗ
				|	Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
				|ГДЕ
				|	Лико_ПеремещениеПаллетаСодержимое.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка,
				|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.Дата,
				|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.АвторДокумента,
				|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
			ЭтапСкладГП = Справочники.Лико_ЭтапыВыполненияЗаказа.СкладГП;
			ЭтапРастарка = Справочники.Лико_ЭтапыВыполненияЗаказа.Растарка;
			Для каждого Строка из ТаблицаЗаказов Цикл
				Если ОтправительУпаковка Тогда
					МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
					МенеджерЗаписи.Этап = ЭтапСкладГП;
					Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
						МенеджерЗаписи.Документ = Ссылка;
					КонецЕсли;
					Попытка
						МенеджерЗаписи.Записать(Истина);
					Исключение
						Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
						Отказ = Истина;
						Прервать;
					КонецПопытки;
				КонецЕсли;
				Если ПолучательРастарка Тогда
					МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
					МенеджерЗаписи.Этап = ЭтапРастарка;
					Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
						МенеджерЗаписи.Документ = Ссылка;
					КонецЕсли;
					МенеджерЗаписи.Комментарий = "" + ПричинаРастарки + ?(ЗначениеЗаполнено(Комментарий), " (" + СокрЛП(Комментарий) + ")", "");
					Попытка
						МенеджерЗаписи.Записать(Истина);
					Исключение
						Сообщить("Не удалось добавить запись в регистр ""лк Этапы заказа"": " + ОписаниеОшибки());
						Отказ = Истина;
						Прервать;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	// --> Начало Лико Митюшин МФМ 21.04.202
	Если ОтправительУпаковка Тогда
		ОтразитьДвижениеЛико_ПланированиеУпаковки(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 21.04.2021

	Иначе
		//нужно сформировать выбытие с АДРЕСНОГО склада
		Для Каждого ТекСтрокаСодержимое Из Содержимое Цикл
			Движение = Движения.Лико_АдресноеХранение.Добавить();
			Движение.Период = Дата;
			Движение.Серия = ТекСтрокаСодержимое.Серия;
			Движение.Склад = СкладПолучатель;
			Движение.ВыбылСоСклада = Истина;
			Движение.Паллет = Паллет;
		КонецЦикла;
	КонецЕсли;
		
	Если ДополнительныеСвойства.Свойство("ТолькоПровестиПоРегистрамДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ СоздатьТиповыеДокументы();

КонецПроцедуры

Процедура ОтразитьДвижениеЛико_ПланированиеУпаковки(ДополнительныеСвойства, Движения, Отказ) Экспорт  // --> Начало Лико Митюшин МФМ 21.04.2021 
	
	Если Отказ Тогда	
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫРАЗИТЬ(ТЧ.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТЧ.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
	|	ТЧ.Серия.Лико_НаправлениеНамотки КАК Намотка,
	|	ТЧ.Серия.Лико_Город КАК Город,
	|	СУММА(ТЧ.Серия.Лико_КоличествоВУпаковке) КАК КоличествоСклад
	|ИЗ
	|	Документ.Лико_ПеремещениеПаллета.Содержимое КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Серия.Лико_ХарактеристикаВладелец,
	|	ТЧ.Серия.Лико_НаправлениеНамотки,
	|	ТЧ.Серия.Лико_Город,
	|	ТЧ.Ссылка.Дата,
	|	ВЫРАЗИТЬ(ТЧ.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТаблицаЛико_ТоварыКПоступлению = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЛико_ТоварыКПоступлению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЛико_ТоварыКПоступлению = Движения.Лико_ПланированиеУпаковки;
	ДвиженияЛико_ТоварыКПоступлению.Записывать = Истина;
	ДвиженияЛико_ТоварыКПоступлению.Загрузить(ТаблицаЛико_ТоварыКПоступлению);
	
КонецПроцедуры  // <-- Конец Лико Митюшин МФМ 21.04.2021 

Функция СоздатьТиповыеДокументы() Экспорт
	
	Отказ = Ложь;	
	НачатьТранзакцию();
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Заказ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	
	//Сначала найдем уже сформированные типовые документы, распроведем их и будем заполнять заново
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ОтключитьЧастьПроверок = Неопределено;
	ДополнительныеСвойства.Свойство("ОтключитьЧастьПроверок", ОтключитьЧастьПроверок);
	ОтключитьЧастьПроверок = ?(ОтключитьЧастьПроверок = Неопределено, Ложь, ОтключитьЧастьПроверок);
	
	Если СкладОтправитель = СкладПолучатель Тогда
		//Если склад-отправитель и склад-получатель один и тот же (разные только ячейки), то создаем документ ОтборРазмещениеТоваров
		Если НЕ СкладОтправитель.ИспользоватьАдресноеХранение Тогда
			ОтменитьТранзакцию();
			Сообщить("Перемещение товаров в пределах одного склада возможно только для ячеистых складов!");
			Возврат Ложь;
		КонецЕсли;
		
		//Проверку напишу только по РС Лико_АдресноеХранение, по типовым регистрам пусть проверяют типовые механизмы
		Таблица = Неопределено;
		Результат = ПроверитьПоАдресномуХранению(Таблица);
		Если НЕ Результат Тогда
			Возврат Ложь;
		КонецЕсли;
		Лико_Дополнительно.ДополнитьТаблицуСерийКолонкамиДляПроведенияДокументов(Таблица);
		
		НовыйДокументОтборРазмещениеТоваров_Перемещение = СоздатьДокументОтборРазмещениеТоваров(Таблица, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Перемещение);
		Если НовыйДокументОтборРазмещениеТоваров_Перемещение = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Перемещение;
		
	Иначе
		//разные склады
		Если СкладОтправитель.ИспользоватьАдресноеХранение Тогда
			//Если Склад-отправитель - ячеистый, то будем проверять по регистру Адресное хранение
			Таблица = Неопределено;
			Результат = ПроверитьПоАдресномуХранению(Таблица);
			Лико_Дополнительно.ДополнитьТаблицуСерийКолонкамиДляПроведенияДокументов(Таблица);
			Если НЕ Результат Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			//если не ячеистый, тогда проверяться все будет типовыми документами
			Таблица = СформироватьТаблицуДляПроведения();
			Лико_Дополнительно.ДополнитьТаблицуСерийКолонкамиДляПроведенияДокументов(Таблица);
		КонецЕсли;
		
		//Создаем документ "Перемещение товаров"
		ТаблицаБезСерий = Таблица.Скопировать(,"Номенклатура,Характеристика,Количество,КоличествоУпаковок");
		ТаблицаБезСерий.Свернуть("Номенклатура,Характеристика", "Количество,КоличествоУпаковок");
		НовыйДокументПеремещениеТоваров = СоздатьДокументПеремещениеТоваров(ТаблицаБезСерий, СтруктураТиповыхДокументов.ПеремещениеТоваров);
		Если НовыйДокументПеремещениеТоваров = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
		НоваяСтрока.Документ = НовыйДокументПеремещениеТоваров;
		
		Если СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке Тогда
			//Создаем документ "Расходный ордер" в статусе "К отбору" (для адресных сладов) или "Отгружен" (для остальных)
			НовыйДокументРасходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументРасходныйОрдерНаТоварыНаОснованииРаспоряжения(СтруктураТиповыхДокументов.РасходныйОрдерНаТовары, Таблица, НовыйДокументПеремещениеТоваров);
			Если НовыйДокументРасходныйОрдерНаТовары = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
			НоваяСтрока.Документ = НовыйДокументРасходныйОрдерНаТовары;
		КонецЕсли;
		
		Если СкладОтправитель.ИспользоватьАдресноеХранение Тогда
			//Создаем документ "Отбор товаров"
			НовыйДокументОтборРазмещениеТоваров_Отбор = Лико_Дополнительно.СоздатьДокументОтборРазмещениеТоваровНаОснованииРасходногоОрдера(НовыйДокументРасходныйОрдерНаТовары, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Отбор, ОтключитьЧастьПроверок); 
			Если НовыйДокументОтборРазмещениеТоваров_Отбор = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
			НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Отбор;
		КонецЕсли;
		
		Если СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке И СкладОтправитель.ИспользоватьАдресноеХранение Тогда
			//Проводим документ "Расходный ордер" в статусе "Отгружен"
			Результат = Лико_Дополнительно.ПровестиДокументВДругомСтатусе(НовыйДокументРасходныйОрдерНаТовары, Перечисления.СтатусыРасходныхОрдеров.Отгружен);
			Если НЕ Результат Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении Тогда
			//Создаем документ "Приходный ордер"
			НовыйДокументПриходныйОрдерНаТовары = Лико_Дополнительно.СоздатьДокументПриходныйОрдерНаТоварыНаОснованииРаспоряжения(НовыйДокументПеремещениеТоваров, СтруктураТиповыхДокументов.ПриходныйОрдерНаТовары, Таблица); 
			Если НовыйДокументПриходныйОрдерНаТовары = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
			НоваяСтрока.Документ = НовыйДокументПриходныйОрдерНаТовары;
		КонецЕсли;
		
		Если СкладПолучатель.ИспользоватьАдресноеХранение И ЗначениеЗаполнено(ЯчейкаПолучатель) И ЯчейкаПолучатель <> Лико_Дополнительно.ПолучитьЗонуПриемкиПоСкладу(СкладПолучатель) Тогда
			//Нужно создавать размещение на складе
			НовыйДокументОтборРазмещениеТоваров_Размещение = Лико_Дополнительно.СоздатьРазмещениеТоваровНаОснованииПриходногоОрдера(НовыйДокументПриходныйОрдерНаТовары, СтруктураТиповыхДокументов.ОтборРазмещениеТоваров_Размещение, ЯчейкаПолучатель);
			Если НовыйДокументОтборРазмещениеТоваров_Размещение = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
			НоваяСтрока.Документ = НовыйДокументОтборРазмещениеТоваров_Размещение;
		КонецЕсли;
	КонецЕсли;
	
	//Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
	Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
	Если НЕ Результат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументОтборРазмещениеТоваров(Таблица, УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	
	НовыйДокОбъект = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	НовыйДокОбъект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение;
	НовыйДокОбъект.ДатаНачалаВыполнения = Дата;
	НовыйДокОбъект.ДатаОкончанияВыполнения = Дата;
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Склад = СкладПолучатель;
	НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	
	//ПредыдущийВид = Неопределено;
	//ПредыдущаяУпаковка = Неопределено;
	УпаковкаТысШт = Справочники.Лико_ПредопределенныеЗначения.УпаковкаТысШт.ЗначениеПараметра;
	Для каждого Строка из Таблица Цикл
		НоваяСтрокаОтбор = НовыйДокОбъект.ТоварыОтбор.Добавить();
		НоваяСтрокаОтбор.Количество = Строка.Количество;
		НоваяСтрокаОтбор.КоличествоОтобрано = Строка.Количество;
		НоваяСтрокаОтбор.КоличествоУпаковок = Строка.Количество;
		НоваяСтрокаОтбор.КоличествоУпаковокОтобрано = Строка.Количество;
		НоваяСтрокаОтбор.Номенклатура = Строка.Номенклатура;
		//Если ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры Тогда
		//	НоваяСтрокаОтбор.Упаковка = ПредыдущаяУпаковка;
		//Иначе
		//	НоваяСтрокаОтбор.Упаковка = Лико_Дополнительно.ПолучитьУпаковкуПоУмолчаниюДляВидаНоменклатуры(НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры);
		//КонецЕсли;
		НоваяСтрокаОтбор.Упаковка = УпаковкаТысШт;
		НоваяСтрокаОтбор.Характеристика = Строка.Характеристика;
		НоваяСтрокаОтбор.Ячейка = ЯчейкаОтправитель;
		НоваяСтрокаОтбор.ВесУпаковки = 1;
		НоваяСтрокаОтбор.Серия = Строка.Серия;
		НоваяСтрокаОтбор.СтатусУказанияСерий = 8;
		
		НоваяСтрокаРазмещение = НовыйДокОбъект.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРазмещение, НоваяСтрокаОтбор,,"Ячейка");
		НоваяСтрокаРазмещение.Ячейка = ЯчейкаПолучатель;
		НоваяСтрокаРазмещение.КоличествоРазмещено = Строка.Количество;
		НоваяСтрокаРазмещение.КоличествоУпаковокРазмещено = Строка.Количество;
		
		//ПредыдущийВид = НоваяСтрокаОтбор.Номенклатура.ВидНоменклатуры;
		//ПредыдущаяУпаковка = НоваяСтрокаОтбор.Упаковка;
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		//чтобы отработали проверки при проведении отбора, его сперва нужно провести в статусе "В работе" или "Подготовлено", а уже потом в статусе "Выполнено без ошибок"
		//(если провести сразу в статусе "Выполнено без ошибок", то проверок не будет и документ без проблем проведется)
		Если НЕ ОтключитьЧастьПроверок Тогда
			НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//меняем статус и проводим еще раз
		НовыйДокОбъект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Сообщить(?(УжеСозданныйДокумент = Неопределено, "Создан", "Перезаполнен") + " документ """ + НовыйДокОбъект + """");
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;                  
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы
	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// Удалим запись из Лико_ЭтапыЗаказа
	ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияРеквизитаДокументВРегистреЭтапыЗаказа.ЗначениеПараметра <= Дата;
	Если ИспользованиеРеквизитаДокументВРегистреЭтапыЗаказа Тогда
		Лико_Дополнительно.УдалитьЗаписиИзРегистраЛико_ЭтапыЗаказовПоДокументу(Ссылка);
	Иначе
		ТаблицаЗаказов = Новый ТаблицаЗначений;
		ТаблицаЗаказов.Колонки.Добавить("Заказ");
		Для каждого Строка из Содержимое Цикл
			НоваяСтрока = ТаблицаЗаказов.Добавить();
			НоваяСтрока.Заказ = Строка.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры;
		КонецЦикла;
		ТаблицаЗаказов.Свернуть("Заказ");
		Для каждого Строка из ТаблицаЗаказов Цикл
			МенеджерЗаписи = РегистрыСведений.Лико_ЭтапыЗаказа.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Дата;
			МенеджерЗаписи.Заказ = Строка.Заказ;
			МенеджерЗаписи.Площадка = Строка.Заказ.Площадка;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Этап = Справочники.Лико_ЭтапыВыполненияЗаказа.СкладГП Тогда
				Попытка
					МенеджерЗаписи.Удалить();	
				Исключение
					Сообщить("Не удалось удалить запись из регистра ""лк Этапы заказа"": " + ОписаниеОшибки());
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьПоАдресномуХранению(Таблица)
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_АдресноеХранениеСрезПоследних.Период) КАК Период,
	|	Лико_АдресноеХранениеСрезПоследних.Паллет
	|ПОМЕСТИТЬ ВТ_ПаллетСПоследнейДатой
	|ИЗ
	|	РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|			&Дата,
	|			Паллет = &Паллет
	|				И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_АдресноеХранениеСрезПоследних.Паллет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_АдресноеХранениеСрезПоследних.Период,
	|	Лико_АдресноеХранениеСрезПоследних.Паллет,
	|	Лико_АдресноеХранениеСрезПоследних.Ячейка,
	|	Лико_АдресноеХранениеСрезПоследних.ВыбылСоСклада,
	|	Лико_АдресноеХранениеСрезПоследних.Серия,
	|	Лико_АдресноеХранениеСрезПоследних.Склад
	|ПОМЕСТИТЬ ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр
	|ИЗ
	|	РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|			&Дата,
	|			(Период, Паллет) В
	|					(ВЫБРАТЬ
	|						Т.Период,
	|						Т.Паллет
	|					ИЗ
	|						ВТ_ПаллетСПоследнейДатой КАК Т)
	|				И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Период,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Паллет,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Ячейка,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.ВыбылСоСклада,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Серия,
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Склад
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр КАК ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_АдресноеХранение.СрезПоследних(
	|				&Дата,
	|				Серия В
	|						(ВЫБРАТЬ
	|							Т.Серия
	|						ИЗ
	|							ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр КАК Т)
	|					И Регистратор <> &Ссылка) КАК Лико_АдресноеХранениеСрезПоследних
	|		ПО ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Период = Лико_АдресноеХранениеСрезПоследних.Период
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Паллет = Лико_АдресноеХранениеСрезПоследних.Паллет
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Серия = Лико_АдресноеХранениеСрезПоследних.Серия
	|			И ВТ_СодержимоеПаллетаВМоментЕгоПоследнейЗаписиВРегистр.Ячейка = Лико_АдресноеХранениеСрезПоследних.Ячейка
	|ГДЕ
	|	НЕ Лико_АдресноеХранениеСрезПоследних.Паллет ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.ЯчейкаОтправитель,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
	|ГДЕ
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПеремещениеПаллетаСодержимое.Серия,
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.ЯчейкаОтправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Период,
	|	ВТ_ДанныеРегистра.Паллет,
	|	ВТ_ДанныеРегистра.Ячейка,
	|	ВТ_ДанныеРегистра.ВыбылСоСклада,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистра.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СерииНетВРегистре,
	|	ВТ_ДанныеДокумента.ЯчейкаОтправитель,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеДокумента.Серия ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СерииНетВДокументе,
	|	ВЫБОР
	|		КОГДА НЕ(ВТ_ДанныеРегистра.Серия ЕСТЬ NULL
	|						ИЛИ ВТ_ДанныеДокумента.Серия ЕСТЬ NULL)
	|				И ВТ_ДанныеРегистра.Ячейка <> ВТ_ДанныеДокумента.ЯчейкаОтправитель
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯчейкиНеСовпадают,
	|	ВТ_ДанныеРегистра.Серия КАК СерияИзРегистра,
	|	ВТ_ДанныеДокумента.Серия КАК Серия,
	|	ВТ_ДанныеДокумента.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
	|	ВТ_ДанныеДокумента.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Номенклатура,
	|	ВТ_ДанныеДокумента.Серия.Лико_КоличествоВУпаковке КАК Количество
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ПО ВТ_ДанныеРегистра.Серия = ВТ_ДанныеДокумента.Серия";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Паллет", Паллет);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	СтрокиСерииНетВРегистре = Таблица.НайтиСтроки(Новый Структура("СерииНетВРегистре", Истина));
	Для каждого Строка из СтрокиСерииНетВРегистре Цикл
		Отказ = Истина;
		Сообщить("Серия """ + Строка.Серия + """ не найдена в регистре Лико_АдресноеХранение!");
	КонецЦикла;
	
	СтрокиСерииНетВДокументе = Таблица.НайтиСтроки(Новый Структура("СерииНетВДокументе", Истина));
	Для каждого Строка из СтрокиСерииНетВДокументе Цикл
		Если ОтключитьЧастьПроверок Тогда
			//При отключенных проверках просто удалим из таблицы эти строки
			Таблица.Удалить(Строка);
		Иначе
			Отказ = Истина;
			Сообщить("Серия """ + Строка.СерияИзРегистра + """ есть в регистре, но ее нет в табличной части документа!");
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСРазличнымиЯчейками = Таблица.НайтиСтроки(Новый Структура("ЯчейкиНеСовпадают", Истина));
	Для каждого Строка из СтрокиСРазличнымиЯчейками Цикл
		Отказ = Истина;
		Сообщить("Серия """ + Строка.СерияИзРегистра + """ по данным регистра лежит в ячейке """ + Строка.Ячейка + """, а по данным документа вы пытаетесь переместить ее из ячейки """ + Строка.ЯчейкаОтправитель + """!");
	КонецЦикла;
	
	СтрокиВыбывшиеСоСклада = Таблица.НайтиСтроки(Новый Структура("ВыбылСоСклада", Истина));
	Для каждого Строка из СтрокиВыбывшиеСоСклада Цикл
		Отказ = Истина;
		Сообщить("Серия """ + Строка.СерияИзРегистра + """ уже выбыла со склада!");
	КонецЦикла;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция СформироватьТаблицуДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец КАК Характеристика,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Номенклатура,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке КАК Количество,
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.ЯчейкаПолучатель
	|ИЗ
	|	Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
	|ГДЕ
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ПеремещениеПаллетаСодержимое.Серия,
	|	Лико_ПеремещениеПаллетаСодержимое.Ссылка.ЯчейкаПолучатель,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Владелец,
	|	Лико_ПеремещениеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Функция СоздатьДокументПеремещениеТоваров(Таблица, УжеСозданныйДокумент = Неопределено)
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	НовыйДокОбъект.Дата = Дата;
	ОрганизацияВладелецТовара = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладОтправитель, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
	НовыйДокОбъект.Организация = ?(ЗначениеЗаполнено(ОрганизацияВладелецТовара), ОрганизацияВладелецТовара, Организация);
	НовыйДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокОбъект.Подразделение = Подразделение;
	НовыйДокОбъект.СкладОтправитель = СкладОтправитель;
	НовыйДокОбъект.СкладПолучатель = СкладПолучатель;
	НовыйДокОбъект.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято;
	НовыйДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	НовыйДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.Лико_НеНужноЗаполнятьОтгрузкиВЗаказе = Истина;
	НовыйДокОбъект.ВариантПриемкиТоваров = Константы.ВариантПриемкиТоваров.Получить();
	
	Для каждого Строка из Таблица Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;
	
	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Площадка) Тогда
		Сообщить("В документе """ + Ссылка + """ не заполнена площадка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Площадка.Организация <> Организация Тогда
		Организация = Площадка.Организация;
	КонецЕсли;
	
	Если НачалоДня(Дата) > НачалоДня(ТекущаяДата())
		И РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ РольДоступна("ПолныеПрава") Тогда
		// --> Начало Лико Ефимов ЕВВ 02.07.2024 Запретим проводить документ будущей датой (были случаи, когда дату меняли случайно)
		Отказ = Истина;
		Сообщить("Нельзя проводить документ с будущей датой");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЯчейкаПолучатель) Тогда
		СкладПолучатель = ЯчейкаПолучатель.Владелец;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЯчейкаОтправитель) Тогда
		СкладОтправитель = ЯчейкаОтправитель.Владелец;
	КонецЕсли;
	
	Если СкладОтправитель.Лико_ТипСклада <> Перечисления.Лико_ТипСклада.ГП ИЛИ СкладПолучатель.Лико_ТипСклада <> Перечисления.Лико_ТипСклада.ГП Тогда
		Отказ = Истина;
		Сообщить("В данном документе можно выбирать только склады с типом ""ГП""");
	КонецЕсли;
	
	Если СкладОтправитель.Родитель <> СкладПолучатель.Родитель Тогда
		Отказ = Истина;
		Сообщить("Склад-отправитель и склад-получатель должны принадлежать одному родителю");
	КонецЕсли;
	
	Если СкладОтправитель.Лико_Площадка <> СкладПолучатель.Лико_Площадка Тогда
		Отказ = Истина;
		Сообщить("Склад-отправитель и склад-получатель должны принадлежать одной площадке");
	КонецЕсли;
	
	Если СкладОтправитель <> СкладПолучатель
		И (СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки
			ИЛИ СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки
			ИЛИ СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи
			ИЛИ СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи 
			// --> Начало Лико Ефимов ЕВВ 05.04.2024
			// Исключение для "ОКИЛ Екатеринбург ОРДЕРНЫЙ" И "ОКИЛ Екатеринбург ОРДЕРНЫЙ для излишков"
			//ИЛИ СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
			//ИЛИ СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
			// <-- Конец Лико Ефимов ЕВВ 05.04.2024
			ИЛИ СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			ИЛИ СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			) Тогда
		Отказ = Истина;
		Сообщить("Перемещать товар между выбранными складами через документ ""Перемещение паллета"" запрещено");
	КонецЕсли;
	// --> Начало Лико Ефимов ЕВВ 05.04.2024 
	// Исключение для "ОКИЛ Екатеринбург ОРДЕРНЫЙ" И "ОКИЛ Екатеринбург ОРДЕРНЫЙ для излишков"
	Если СкладОтправитель <> СкладПолучатель
		И (СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион
			ИЛИ СкладПолучатель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион) Тогда
			
		Если СкладОтправитель.Лико_Площадка <> СкладПолучатель.Лико_Площадка
			ИЛИ НЕ ЗначениеЗаполнено(СкладОтправитель.Лико_Площадка)
			ИЛИ НЕ ЗначениеЗаполнено(СкладПолучатель.Лико_Площадка)  Тогда
			Отказ = Истина;
			Сообщить("Перемещать товар между складами с типом ""Регион"" разрешено только с одинаковой и заполненной площадкой в складе"); 
		КонецЕсли; 
		ОрганизацияВладелецТовараОтправитель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладОтправитель, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
		ОрганизацияВладелецТовараПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладПолучатель, "ОрганизациявладелецТовара_45268c9975cc4604bdcfde6c95172d5f");
		
		Если ОрганизацияВладелецТовараОтправитель <> ОрганизацияВладелецТовараПолучатель
			ИЛИ НЕ ЗначениеЗаполнено(ОрганизацияВладелецТовараОтправитель)
			ИЛИ НЕ ЗначениеЗаполнено(ОрганизацияВладелецТовараПолучатель)  Тогда
			Отказ = Истина;
			Сообщить("Перемещать товар между складами с типом ""Регион"" разрешено только с одинаковой и заполненной организацей-владельцем товара"); 
		КонецЕсли; 
		
	КонецЕсли; 
	// <-- Конец Лико Ефимов ЕВВ 05.04.2024
	
	Если ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, СкладПолучатель, "ЯчейкаРастарка") Тогда 
		
		// --> Начало Лико Яцун 15.07.2022 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка КАК Ссылка,
		|	Лико_ЗаявкаНаТранспортировкуПродукция.Серия КАК Серия,
		|	Лико_ЗаявкаНаТранспортировкуПродукция.Мест КАК Мест
		|ИЗ
		|	Документ.Лико_ЗаявкаНаТранспортировку.Продукция КАК Лико_ЗаявкаНаТранспортировкуПродукция
		|ГДЕ
		|	Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Проведен
		|	И Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
		|	И НЕ Лико_ЗаявкаНаТранспортировкуПродукция.Ссылка.ПометкаУдаления
		|	И Лико_ЗаявкаНаТранспортировкуПродукция.Серия В(&МассивСерий)
		|	И Лико_ЗаявкаНаТранспортировкуПродукция.Мест = 1";
		
		Запрос.УстановитьПараметр("МассивСерий", Содержимое.ВыгрузитьКолонку("Серия"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
			Отказ = Истина;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				Сообщить("Коробка " + ВыборкаДетальныеЗаписи.Серия + " добавлена в документ " + ВыборкаДетальныеЗаписи.Ссылка); 
			КонецЦикла;
		КонецЕсли;
		// <-- Конец Лико Яцун 15.07.2022
		
		Если НЕ ЗначениеЗаполнено(ПричинаРастарки) И Дата >= Дата('20191106') Тогда
			Отказ = Истина;
			Сообщить("Необходимо выбрать причину растарки");
		КонецЕсли;
		
		Если Дата >= Дата(2020,10,07,15,30,00) И ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки Тогда
			МассивСерийИзРастарки = Новый Массив;
			Для каждого Строка из Содержимое Цикл
				Если Строка.Серия.Лико_ВыпускИзРастарки Тогда
					МассивСерийИзРастарки.Добавить(Строка.Серия);
				КонецЕсли;
			КонецЦикла;
			Если МассивСерийИзРастарки.Количество() > 0 Тогда
				Отказ = Истина;
				Сообщить("В документе содержатся коробки, которые выпущены из растарки. Для таких коробок нельзя выбирать причину растарки """ + ПричинаРастарки + """. Нужно выбрать ту причину, по которой растаривали изначальную коробку. Список коробок: ");
				Для каждого Серия из МассивСерийИзРастарки Цикл
					Сообщить("" + Серия);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			ИЛИ СкладОтправитель.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.Регион)
		И ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки Тогда
		Отказ = Истина;
		Сообщить("Для склада ответственного хранения или склада региона нельзя выбирать причину растарки """ + ПричинаРастарки + """");
	КонецЕсли;
	
	// --> Начало Лико Ефимов ЕВВ 27.06.2022
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Паллет <> Паллет
		И НЕ РольДоступна("ПолныеПрава")
		Тогда
		Отказ = Истина;
		Сообщить("Запрещено менять паллет у существующего документа");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 27.06.2022

	Если ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.Прочее ИЛИ ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки Тогда
		УдалитьВыпуск = Истина;
	Иначе
		УдалитьВыпуск = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#Область ОбработчикиФорм //добавляю сюда, чтобы не править код в нескольких формах (обычной и ТСД)

Процедура ПаллетПриИзменении() Экспорт
	
	Содержимое.Очистить();
	ЯчейкаОтправитель = Неопределено;
	СкладОтправитель = Неопределено;
	
	//Найдем где сейчас лежит паллет
	ТаблицаСерий = Лико_Дополнительно.ПолучитьСодержимоеПаллета(Паллет, ?(НЕ ЗначениеЗаполнено(Дата) ИЛИ Дата = НачалоДня(ТекущаяДата()), ТекущаяДата(), Дата), Ссылка);
	
	Если ТаблицаСерий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйЗаходВЦикл = Истина;
	Для каждого Строка из ТаблицаСерий Цикл                          
		Если ПервыйЗаходВЦикл Тогда
			Если Строка.ВыбылСоСклада И НЕ ЗначениеЗаполнено(Строка.Склад) Тогда
				Сообщить("Паллет выбыл со склада!");
			КонецЕсли;
			СкладОтправитель = Строка.Склад;
			ЯчейкаОтправитель = Строка.Ячейка;
			ПервыйЗаходВЦикл = Ложь;
		КонецЕсли;
		НоваяСтрока = Содержимое.Добавить();
		НоваяСтрока.Серия = Строка.Серия;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуРастарки() Экспорт

	Объект = ЭтотОбъект; // Чтобы не переписывать код
	
	Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) ИЛИ НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) ИЛИ Объект.ЯчейкаПолучатель <> Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.СкладПолучатель, "ЯчейкаРастарка") Тогда
		Объект.ЗаказыНаРастарку.Очистить();
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Т.НомерСтроки КАК ЧИСЛО(10, 0)) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Т.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаСерий КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоИсходнаяСтрока,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец КАК Характеристика,
		|	СерииНоменклатуры.Лико_НаправлениеНамотки КАК Намотка,
		|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
		|	СерииНоменклатуры.Лико_НомерПоставки КАК НомерПоставки,
		|	СерииНоменклатуры.Лико_Город КАК Город,
		|	СУММА(СерииНоменклатуры.Лико_КоличествоВУпаковке) КАК Количество,
		|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура).Наименование КАК НоменклатураНаименование,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Наименование КАК ХарактеристикаНаименование
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|		ПО ВТ.Серия = СерииНоменклатуры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец,
		|	СерииНоменклатуры.Лико_НаправлениеНамотки,
		|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика,
		|	СерииНоменклатуры.Лико_ЧестныйЗнак,
		|	СерииНоменклатуры.Лико_НомерПоставки,
		|	СерииНоменклатуры.Лико_Город,
		|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура).Наименование,
		|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование,
		|	ХарактеристикаНаименование,
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТаблицаСерий", Объект.Содержимое.Выгрузить(,"Серия,НомерСтроки"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатТаблица = РезультатЗапроса.Выгрузить();
	
	МассивСтрокКУдалению = Новый Массив;
	СтрокаНекопируемыхСвойств = "НомерСтроки,ЭтоИсходнаяСтрока";
	СтрокаСтрокДляОтбора = "ЭтоИсходнаяСтрока,Характеристика,Намотка,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Город";
	
	Для каждого СтрокаТЧ из Объект.ЗаказыНаРастарку Цикл
		Если СтрокаТЧ.ЭтоИсходнаяСтрока Тогда
			СтруктураОтбора = Новый Структура(СтрокаСтрокДляОтбора);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
			НайденныеСтроки = РезультатТаблица.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				// В выборке нет такой строки, нужно удалить
				НайденныеСтрокиПоИдентификатору = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи", СтрокаТЧ.ИдентификаторСвязи));
				Для каждого НайденнаяСтрокаПоИдентификатору из НайденныеСтрокиПоИдентификатору Цикл
					МассивСтрокКУдалению.Добавить(НайденнаяСтрокаПоИдентификатору);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из РезультатТаблица Цикл
		// Попробуем найти такую строку
		СтруктураОтбора = Новый Структура(СтрокаСтрокДляОтбора);
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Строка);
		НайденныеИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(СтруктураОтбора);
		Если НайденныеИсходныеСтроки.Количество() > 0 Тогда
			НайденнаяИсходнаяСтрока = НайденныеИсходныеСтроки[0];
			Если НайденнаяИсходнаяСтрока.Количество = Строка.Количество Тогда
				// Строка совпадает, ничего делать не нужно
				Продолжить;
			Иначе
				// Количество не совпадает, поменяем количество и перезаполним НЕисходные строки
				НайденнаяИсходнаяСтрока.Количество = Строка.Количество;
				НайденныеНЕисходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ЭтоИсходнаяСтрока,ИдентификаторСвязи", Ложь, НайденнаяИсходнаяСтрока.ИдентификаторСвязи));
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрокКУдалению, НайденныеНЕисходныеСтроки, Истина);
				Если НайденнаяИсходнаяСтрока.НомерСтроки = Объект.ЗаказыНаРастарку.Количество() Тогда
					// Добавим в конец
					НоваяСтрока = Объект.ЗаказыНаРастарку.Добавить();
				Иначе
					// Вставим после текущей строки
					НоваяСтрока = Объект.ЗаказыНаРастарку.Вставить(НайденнаяИсходнаяСтрока.НомерСтроки);
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяИсходнаяСтрока,,СтрокаНекопируемыхСвойств);
			КонецЕсли;
		Иначе
			// Такая строка не найдена, добавим 2 новые (исходную и НЕисходную)
			НоваяСтрокаИсходная = Объект.ЗаказыНаРастарку.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИсходная, Строка);
			НоваяСтрокаИсходная.ЭтоИсходнаяСтрока = Истина;
			НоваяСтрокаИсходная.ИдентификаторСвязи = Строка(Новый УникальныйИдентификатор);
			
			НоваяСтрокаНЕисходная = Объект.ЗаказыНаРастарку.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНЕисходная, НоваяСтрокаИсходная,,СтрокаНекопируемыхСвойств);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка из МассивСтрокКУдалению Цикл
		Объект.ЗаказыНаРастарку.Удалить(Строка);
	КонецЦикла;
	
	ТекущийИдентификаторСвязи = Неопределено;
	НомерЦепочки = 0;
	Для каждого Строка из Объект.ЗаказыНаРастарку Цикл
		Если ТекущийИдентификаторСвязи = Неопределено ИЛИ ТекущийИдентификаторСвязи <> Строка.ИдентификаторСвязи Тогда
			НомерЦепочки = НомерЦепочки + 1;
		КонецЕсли;
		Строка.НомерЦепочки = НомерЦепочки;
		ТекущийИдентификаторСвязи = Строка.ИдентификаторСвязи;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

КлючиСтруктуры =	"ОтборРазмещениеТоваров_Размещение,
					|ПриходныйОрдерНаТовары,
					|ОтборРазмещениеТоваров_Отбор,
					|ОтборРазмещениеТоваров_Перемещение,
					|РасходныйОрдерНаТовары,
					|ПеремещениеТоваров";
ОтключитьЧастьПроверок = Ложь;
